HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCpu_bf.h
/** \\brief  Mask for Ifx_CPU_PMA0_Bits.DAC_B */
#define IFX_CPU_PMA0_DAC_B_MSK (0x3)

/** \\brief  Offset for Ifx_CPU_PMA0_Bits.DAC_B */
#define IFX_CPU_PMA0_DAC_B_OFF (11)

/** \\brief  Length for Ifx_CPU_PMA0_Bits.DAC_D */
#define IFX_CPU_PMA0_DAC_D_LEN (3)

/** \\brief  Mask for Ifx_CPU_PMA0_Bits.DAC_D */
#define IFX_CPU_PMA0_DAC_D_MSK (0x7)

/** \\brief  Offset for Ifx_CPU_PMA0_Bits.DAC_D */
#define IFX_CPU_PMA0_DAC_D_OFF (13)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_0 */
#define IFX_CPU_PMA1_CAC_0_LEN (10)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_0 */
#define IFX_CPU_PMA1_CAC_0_MSK (0x3ff)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_0 */
#define IFX_CPU_PMA1_CAC_0_OFF (0)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_A */
#define IFX_CPU_PMA1_CAC_A_LEN (1)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_A */
#define IFX_CPU_PMA1_CAC_A_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_A */
#define IFX_CPU_PMA1_CAC_A_OFF (10)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_B */
#define IFX_CPU_PMA1_CAC_B_LEN (1)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_B */
#define IFX_CPU_PMA1_CAC_B_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_B */
#define IFX_CPU_PMA1_CAC_B_OFF (11)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_C */
#define IFX_CPU_PMA1_CAC_C_LEN (1)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_C */
#define IFX_CPU_PMA1_CAC_C_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_C */
#define IFX_CPU_PMA1_CAC_C_OFF (12)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_D */
#define IFX_CPU_PMA1_CAC_D_LEN (1)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_D */
#define IFX_CPU_PMA1_CAC_D_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_D */
#define IFX_CPU_PMA1_CAC_D_OFF (13)

/** \\brief  Length for Ifx_CPU_PMA1_Bits.CAC_E */
#define IFX_CPU_PMA1_CAC_E_LEN (2)

/** \\brief  Mask for Ifx_CPU_PMA1_Bits.CAC_E */
#define IFX_CPU_PMA1_CAC_E_MSK (0x3)

/** \\brief  Offset for Ifx_CPU_PMA1_Bits.CAC_E */
#define IFX_CPU_PMA1_CAC_E_OFF (14)

/** \\brief  Length for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_LEN (16)

/** \\brief  Mask for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_MSK (0xffff)

/** \\brief  Offset for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_OFF (0)

/** \\brief  Length for Ifx_CPU_PSTR_Bits.FBE */
#define IFX_CPU_PSTR_FBE_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSTR_Bits.FBE */
#define IFX_CPU_PSTR_FBE_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSTR_Bits.FBE */
#define IFX_CPU_PSTR_FBE_OFF (2)

/** \\brief  Length for Ifx_CPU_PSTR_Bits.FGAE */
#define IFX_CPU_PSTR_FGAE_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSTR_Bits.FGAE */
#define IFX_CPU_PSTR_FGAE_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSTR_Bits.FGAE */
#define IFX_CPU_PSTR_FGAE_OFF (1)

/** \\brief  Length for Ifx_CPU_PSTR_Bits.FME */
#define IFX_CPU_PSTR_FME_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSTR_Bits.FME */
#define IFX_CPU_PSTR_FME_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSTR_Bits.FME */
#define IFX_CPU_PSTR_FME_OFF (14)

/** \\brief  Length for Ifx_CPU_PSTR_Bits.FPE */
#define IFX_CPU_PSTR_FPE_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSTR_Bits.FPE */
#define IFX_CPU_PSTR_FPE_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSTR_Bits.FPE */
#define IFX_CPU_PSTR_FPE_OFF (12)

/** \\brief  Length for Ifx_CPU_PSTR_Bits.FRE */
#define IFX_CPU_PSTR_FRE_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSTR_Bits.FRE */
#define IFX_CPU_PSTR_FRE_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSTR_Bits.FRE */
#define IFX_CPU_PSTR_FRE_OFF (0)

/** \\brief  Length for Ifx_CPU_PSW_Bits.AV */
#define IFX_CPU_PSW_AV_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.AV */
#define IFX_CPU_PSW_AV_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.AV */
#define IFX_CPU_PSW_AV_OFF (28)

/** \\brief  Length for Ifx_CPU_PSW_Bits.C */
#define IFX_CPU_PSW_C_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.C */
#define IFX_CPU_PSW_C_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.C */
#define IFX_CPU_PSW_C_OFF (31)

/** \\brief  Length for Ifx_CPU_PSW_Bits.CDC */
#define IFX_CPU_PSW_CDC_LEN (7)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.CDC */
#define IFX_CPU_PSW_CDC_MSK (0x7f)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.CDC */
#define IFX_CPU_PSW_CDC_OFF (0)

/** \\brief  Length for Ifx_CPU_PSW_Bits.CDE */
#define IFX_CPU_PSW_CDE_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.CDE */
#define IFX_CPU_PSW_CDE_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.CDE */
#define IFX_CPU_PSW_CDE_OFF (7)

/** \\brief  Length for Ifx_CPU_PSW_Bits.GW */
#define IFX_CPU_PSW_GW_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.GW */
#define IFX_CPU_PSW_GW_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.GW */
#define IFX_CPU_PSW_GW_OFF (8)

/** \\brief  Length for Ifx_CPU_PSW_Bits.IO */
#define IFX_CPU_PSW_IO_LEN (2)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.IO */
#define IFX_CPU_PSW_IO_MSK (0x3)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.IO */
#define IFX_CPU_PSW_IO_OFF (10)

/** \\brief  Length for Ifx_CPU_PSW_Bits.IS */
#define IFX_CPU_PSW_IS_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.IS */
#define IFX_CPU_PSW_IS_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.IS */
#define IFX_CPU_PSW_IS_OFF (9)

/** \\brief  Length for Ifx_CPU_PSW_Bits.PRS */
#define IFX_CPU_PSW_PRS_LEN (2)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.PRS */
#define IFX_CPU_PSW_PRS_MSK (0x3)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.PRS */
#define IFX_CPU_PSW_PRS_OFF (12)

/** \\brief  Length for Ifx_CPU_PSW_Bits.S */
#define IFX_CPU_PSW_S_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.S */
#define IFX_CPU_PSW_S_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.S */
#define IFX_CPU_PSW_S_OFF (14)

/** \\brief  Length for Ifx_CPU_PSW_Bits.SAV */
#define IFX_CPU_PSW_SAV_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.SAV */
#define IFX_CPU_PSW_SAV_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.SAV */
#define IFX_CPU_PSW_SAV_OFF (27)

/** \\brief  Length for Ifx_CPU_PSW_Bits.SV */
#define IFX_CPU_PSW_SV_LEN (1)

/** \\brief  Mask for Ifx_CPU_PSW_Bits.SV */
#define IFX_CPU_PSW_SV_MSK (0x1)

/** \\brief  Offset for Ifx_CPU_PSW_Bits.SV */
#define IFX_CPU_PSW_SV_OFF (29)

/** \\brief  Length for Ifx_CPU_PSW_Bits.V */
#define IFX_CPU_PSW_V_LEN (1)

